Revit 2024 API
ElementIntersectsElementFilter.GetElement Method
 Gets the target element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Element GetElement()
Visual Basic
Public Function GetElement As Element
Visual C++
public:
Element^ GetElement()
Return Value
 The element.
See Also
ElementIntersectsElementFilter Class
Autodesk.Revit.DB Namespace